# ===Переменные используемые во вьюхах===
ADS_PER_PAGE = 1 # Количество обьявлений на 1 страницу
MSG_NO_PERMISSION = 'У вас нет прав на это действие' # Если у пользователя нет прав удалять или редактировать обьявление или еще какието запреты
MSG_AD_DELETED = 'Объявление успешно удалено!' 
MSG_AD_CREATED = 'Объявление успешно создано!'
MSG_AD_EDITED = 'Изменения сохранены!'
MSG_ACCEPTED = 'Предложение было принято!'
MSG_REJECTED = 'Предложение было отклонено!'
MSG_REGISTRATION_REJECTED = 'Произошла ошибка при регистрации, повторите попытку.'
MSG_SEND_CODE_ERROR = 'Произошла ошибка при отправке кода. Повторите позже.'
MSG_INVALID_LOGIN_OR_PASSWORD = 'Неверный логин или пароль'
MSG_CODE_ISSUE = 'Ошибка проверки кода. Попробуйте снова позже.'
MSG_INVALID_CODE = 'Неверный код'
MSG_LOGIN_SUCCESS = 'Вы успешно вошли в аккаунт!'
MSG_REGISTRATION_3_STEP_ISSUE = 'Не удалось зарегистрироваться, повторите попытку'
MSG_EMAIL_ALREADY_TAKEN = 'Эта почта уже используется'
MSG_ACCOUNT_CREATED = 'Аккаунт успешно создан!'
# ===Переменные используемые во вьюхах===

EMAIL_CODE_TTL = 60 * 8